Revit 2024 API
RebarUpdateCurvesData.IsEndConstraintChanged Property
 Indicates if the end handle constraint has changed since the last regeneration.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public bool IsEndConstraintChanged { get; }
Visual Basic
Public ReadOnly Property IsEndConstraintChanged As Boolean
	Get
Visual C++
public:
property bool IsEndConstraintChanged {
	bool get ();
}
See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace